<a href="https://colab.research.google.com/github/wesleybeckner/technology_fundamentals/blob/main/C1%20Fundamentals/SOLUTIONS/SOLUTION_Tech_Fun_C1_L3_Practice_with_Functions_and_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Technology Fundamentals Course 1, Lab 3: Practice with Functions and Pandas

**Instructor**: Wesley Beckner

**Contact**: wesleybeckner@gmail.com

**Teaching Assitants** Varsha Bang, Harsha Vardhan

**Contact** vbang@uw.edu, harshav@uw.edu

<br>

---

<br>

In this lab we will continue to practice writing functions as well as manipulating pandas DataFrames.

<br>

---

In [38]:
import pandas as pd
import numpy as np

# Part I

# L3 Q1: Basic Function Writing

## Part A

Write a Python function to find the Max of three numbers

In [2]:
# Code Cell for L3 Q1 A
def find(a, b, c):
  if (a > b) & (a > c):
    return a
  elif (b > c) & (b > a):
    return b
  else:
    return c

find(10, 20, 50)

50

## Part B

Write a Python function to multiply all the numbers in a list

Example:

```
Sample List : (8, 2, 3, -1, 7)
Expected Output : -336
```

In [6]:
# Code Cell for L3 Q1 B
def mult(ls):
  ans = 1
  for i in ls:
    ans *= i
  return ans

mult([1,2,9])

18

## Part C

Write a Python program to reverse a string

Example:

```
Sample String : "1234abcd"
Expected Output : "dcba4321"
```

In [7]:
# Code Cell for L3 Q1 C
a = "1234abcd"
def rev(a):
  return a[::-1]

rev(a)

'dcba4321'

# L2 Q2: Finding Unique Elements

Write a Python function that takes a list and returns a new list with unique elements of the first list

Example:
```
Sample List : [1,2,3,3,3,3,4,5]
Unique List : [1, 2, 3, 4, 5]
```

In [8]:
# Cell for L3 Q2
ls = [1,2,3,3,3,3,4,5]

def uni(ls):
  ans = []
  for i in ls:
    if i not in ans:
      ans.append(i)
  return ans

uni(ls)

[1, 2, 3, 4, 5]

# L3 Q3: Computing Factorials

Write a Python function to calculate the factorial of a number (a non-negative integer). The function accepts the number as an argument

Example: 

```
Input: 4                                                       
Output: 24
```

In [10]:
# Cell for L3 Q3

num = 4

def fact(num):
  j = 1
  for i in range(1,num+1):
    j *= i
  return j

fact(num)

24

# Practicing our hand at functions by implementing recursion

We will practice the last exercise we did yesterday, this time using what we've learned about functions to write a _recursive function_

A recursive function is a function that makes a call to itself. This is particularly well suited for tasks that would otherwise require a lot of memory to hold intermediary solutions (when they are combined with a strategy called _memoization_ which we will shy away from here). The Fibonnaci sequence is a good place for such a problem. So is a factorial calculation. See here below

3! = 3 * 2 * 1
4! = 4 * 3 * 2 * 1

In [11]:
def factorial(x):
    """This is a recursive function
    to find the factorial of an integer"""

    if x == 1:
        return 1
    else:
        # one trick to note that is common with recursive functions
        # is that the incrementation in the key variable is done
        # in the call to the function itself (vs a for loop)
        return (x * factorial(x-1))

In [12]:
n = 3
factorial(n)

6

In the above, we have on lines 5 and 6, what we call the _baseline_ solution. It is the answer to the simplest subset of the problem. When we build a recursive tree, it is useful to think of the smallest problem, and work upwards, providing this _leaf_ solution to nodes further up on the recursive tree. Like so:

In [ ]:
# 1! = 1
# 2! = 2 * 1!
# 3! = 3 * 2!
# N! = N * (N-1)! ... like ... like so

This problem is intended to be a fun way to wrap our heads around functions... don't stress. If you want to see a further breakdown of the factorial problem, check out [this link](https://www.programiz.com/python-programming/recursion)

# L3 Q4: Recursive Functions

Using recursion, complete the Fibonacci sequence up to the 10th place using recursion and any or all of the following:
* `if` `elif` `else`
* `range`

The Fibonacci sequence with indices:

1. 0
2. 1
3. 1
4. 2
5. 3
6. 5
7. 8
8. etc..

Example input:

`index = 10`

Example output:
```
Index: 10
Value: 34
```

In [36]:
# Cell for L2 Q3
index = 10

def fib(index):
  if (index == 0) or (index == 1):
    return index
  elif (index == 2) or (index == 3): # note because of the wierd index start 
    return 1
  else:
    return fib(index-1) + fib(index-2)

fib(10)

34

# Part II

# L3 Q1 

Convert the two series into the columns of a DataFrame

In [39]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

pd.DataFrame([ser1, ser2]).T

    0   1
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

# L3 Q2

Conver the series into a DataFrame with 7 rows and 5 columns

In [42]:
ser = pd.Series(np.random.randint(1, 10, 35))
pd.DataFrame(ser.values.reshape(7, 5))

   0  1  2  3  4
0  9  5  5  3  9
1  9  5  5  7  6
2  5  4  5  6  1
3  6  4  1  1  9
4  2  2  8  1  4
5  1  5  4  5  1
6  8  3  9  1  8

# L3 Q3

Compute the difference of differences between consecutive numbers in a series using `ser.diff()`

In [44]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])
ser.diff().diff()

0    NaN
1    NaN
2    1.0
3    1.0
4    1.0
5    1.0
6    0.0
7    2.0
dtype: float64

# L3 Q4 

Convert a series of dates to `datetime` format using `pd.to_datetime()`

In [45]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

# L3 Q5

Compute the mean of weights grouped by fruit

In [51]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())

df = pd.DataFrame([fruit,weights]).T
df.columns = ['fruit', 'weight']
df['weight'] = df['weight'].astype(int)
df.groupby('fruit')['weight'].mean()

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['apple', 'carrot', 'carrot', 'carrot', 'banana', 'banana', 'carrot', 'carrot', 'carrot', 'carrot']

fruit
apple     1.000000
banana    5.500000
carrot    6.142857
Name: weight, dtype: float64

# L3 Q6

Compute the euclidian distance between vectors p and q (pythagorean theorem)

In [54]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

sum((p-q)**2)**.5

18.16590212458495

# L3 Q7

Fill in missing values for dates with the previous dates' value using `ser.bfill()` or `ser.ffill()`

In [56]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
print(ser)
ser.ffill()

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     3.0
dtype: float64

# L3 Q8

Check if there are missing values in a dataframe using `.isnull()`, `.values`, and `.any()`

In [60]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')
df.isnull().values.any()

True

# L3 Q9

Grab the first column and return it as a DataFrame rather than as a series

In [62]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[['a']]

    a
0   0
1   5
2  10
3  15

# L3 Q10

In `df`, interchange columns 'a' and 'c'.

In [64]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[['c','b','a','d','e']]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19